photo-viewer-api/app/controllers/photos_controller.rb

def index
    @photos = Photo.all
    if params[:filter] && params[:filter]!='false'
        photoByDimensions
    elsif params[:page] && !params[:filter]
    render json: {data: @photos.paginate(page: params[:page], per_page: 10).as_json(only: [:id,:url]), pages: (Photo.all.count.to_f/10.0).ceil}
---
SELECT "photos".* FROM "photos"
SELECT "photos".* FROM "photos" LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "photos"

def show
    begin
   @photo = Photo.find(params[:id])
---
SELECT "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

def getDimensions
    @dimensionsArr = Photo.select(:dimensions).group(:dimensions)
---
SELECT "photos"."dimensions" FROM "photos" GROUP BY "photos"."dimensions"

def photoByDimensions
    @photos = Photo.where(dimensions: params[:filter])
    if params[:page]
      render json: @photos.paginate(page: params[:page], per_page: 10)
---
SELECT "photos".* FROM "photos" WHERE "photos"."dimensions" = $1  [["dimensions", "300x200"]]
SELECT COUNT(*) FROM "photos"