photo-viewer-api/app/controllers/photos_controller.rb

def find_photo
    begin
    @photo = Photo.find(params[:id])
---
SELECT "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]